In [3]:
import pandas as pd

In [ ]:
df = pd.read_csv("Supermarket sales 2.csv")   # read CSV
# df.to_excel("Supermarket sales 2.xlsx", index=False)
# df = pd.read_excel("Supermarket sales 2.xlsx" ,sheet_name=0)
df

ModuleNotFoundError: No module named 'openpyxl'

In [18]:
df

,Date,Branch,Customer type,Gender,Product line,Unit price,Quantity,Payment,Rating
0,1/1/2024,Brooklyn,Member,Female,Food & Beverages,84.63,10,Credit card,9.0
1,1/1/2024,Queens,Normal,Female,Electronics,63.22,2,Cash,8.5
2,1/1/2024,Brooklyn,Normal,Female,Electronics,74.71,6,Cash,6.7
3,1/1/2024,Queens,Member,Female,Sports & Travel,36.98,10,Credit card,7.0
4,1/1/2024,Manhattan,Member,Female,Sports & Travel,27.04,4,Ewallet,6.9
...,...,...,...,...,...,...,...,...,...
5048,12/31/2024,Manhattan,Normal,Female,Food & Beverages,6.71,10,Cash,5.9
5049,12/31/2024,Brooklyn,Normal,Male,Food & Beverages,6.79,9,Credit card,4.8
5050,12/31/2024,Queens,Member,Male,Electronics,85.05,7,Ewallet,4.4
5051,12/31/2024,Manhattan,Member,Female,Sports & Travel,54.64,10,Credit card,4.8
5052,12/31/2024,Queens,Normal,Female,Health & Beauty,49.75,7,Cash,5.8

In [5]:
#df.to_excel("supermarket sales 2.xlsx", index=False)
# df1 =pd.to_excel("Supermarket Sales 2.csv")
# print(df1)
#df.to_json("Supermarket Sales 2.csv")
# df
# df = pd.read_excel

In [ ]:
df.head() # first 5 values are given when arrguments are given

,Date,Branch,Customer type,Gender,Product line,Unit price,Quantity,Payment,Rating
0,1/1/2024,Brooklyn,Member,Female,Food & Beverages,84.63,10,Credit card,9.0
1,1/1/2024,Queens,Normal,Female,Electronics,63.22,2,Cash,8.5
2,1/1/2024,Brooklyn,Normal,Female,Electronics,74.71,6,Cash,6.7
3,1/1/2024,Queens,Member,Female,Sports & Travel,36.98,10,Credit card,7.0
4,1/1/2024,Manhattan,Member,Female,Sports & Travel,27.04,4,Ewallet,6.9

In [20]:
df.head(10)# first 10 values are given

,Date,Branch,Customer type,Gender,Product line,Unit price,Quantity,Payment,Rating
0,1/1/2024,Brooklyn,Member,Female,Food & Beverages,84.63,10,Credit card,9.0
1,1/1/2024,Queens,Normal,Female,Electronics,63.22,2,Cash,8.5
2,1/1/2024,Brooklyn,Normal,Female,Electronics,74.71,6,Cash,6.7
3,1/1/2024,Queens,Member,Female,Sports & Travel,36.98,10,Credit card,7.0
4,1/1/2024,Manhattan,Member,Female,Sports & Travel,27.04,4,Ewallet,6.9
5,1/1/2024,Manhattan,Normal,Female,Fashion & Accs,65.74,9,Cash,7.7
6,1/1/2024,Manhattan,Member,Male,Home & Lifestyle,47.59,8,Cash,5.7
7,1/1/2024,Manhattan,Normal,Male,Sports & Travel,72.61,6,Credit card,6.9
8,1/1/2024,Queens,Normal,Male,Health & Beauty,62.87,2,Cash,5.0
9,1/1/2024,Brooklyn,Normal,Male,Food & Beverages,21.12,8,Cash,6.3

In [21]:
df.tail() #last 5 value are given when arrguments are given

,Date,Branch,Customer type,Gender,Product line,Unit price,Quantity,Payment,Rating
5048,12/31/2024,Manhattan,Normal,Female,Food & Beverages,6.71,10,Cash,5.9
5049,12/31/2024,Brooklyn,Normal,Male,Food & Beverages,6.79,9,Credit card,4.8
5050,12/31/2024,Queens,Member,Male,Electronics,85.05,7,Ewallet,4.4
5051,12/31/2024,Manhattan,Member,Female,Sports & Travel,54.64,10,Credit card,4.8
5052,12/31/2024,Queens,Normal,Female,Health & Beauty,49.75,7,Cash,5.8

In [22]:
df.tail(10) #last 10 value are given

,Date,Branch,Customer type,Gender,Product line,Unit price,Quantity,Payment,Rating
5043,12/31/2024,Brooklyn,Member,Female,Sports & Travel,71.73,6,Credit card,7.1
5044,12/31/2024,Manhattan,Member,Female,Electronics,73.14,4,Ewallet,8.8
5045,12/31/2024,Manhattan,Member,Male,Health & Beauty,25.32,10,Ewallet,3.3
5046,12/31/2024,Queens,Member,Male,Home & Lifestyle,59.64,3,Ewallet,6.7
5047,12/31/2024,Queens,Normal,Female,Electronics,80.72,1,Ewallet,6.6
5048,12/31/2024,Manhattan,Normal,Female,Food & Beverages,6.71,10,Cash,5.9
5049,12/31/2024,Brooklyn,Normal,Male,Food & Beverages,6.79,9,Credit card,4.8
5050,12/31/2024,Queens,Member,Male,Electronics,85.05,7,Ewallet,4.4
5051,12/31/2024,Manhattan,Member,Female,Sports & Travel,54.64,10,Credit card,4.8
5052,12/31/2024,Queens,Normal,Female,Health & Beauty,49.75,7,Cash,5.8

In [ ]:
df.sample() # random data given from whole data

,Date,Branch,Customer type,Gender,Product line,Unit price,Quantity,Payment,Rating
3828,10/24/2024,Manhattan,Normal,Female,Fashion & Accs,23.84,9,Ewallet,5.8

In [24]:
df.sample(10)

,Date,Branch,Customer type,Gender,Product line,Unit price,Quantity,Payment,Rating
464,2/9/2024,Queens,Normal,Female,Electronics,12.45,6,Cash,4.1
2449,7/12/2024,Brooklyn,Normal,Male,Food & Beverages,7.64,2,Credit card,7.6
980,3/28/2024,Queens,Normal,Female,Electronics,47.65,3,Credit card,9.5
3067,9/1/2024,Manhattan,Normal,Female,Fashion & Accs,14.07,5,Ewallet,5.1
4838,12/22/2024,Queens,Member,Female,Sports & Travel,73.87,7,Cash,9.6
4549,12/4/2024,Manhattan,Normal,Female,Sports & Travel,66.15,9,Ewallet,9.1
3568,10/5/2024,Brooklyn,Normal,Male,Sports & Travel,56.00,3,Cash,3.6
4453,11/29/2024,Manhattan,Member,Male,Food & Beverages,11.01,1,Ewallet,5.7
1242,4/13/2024,Brooklyn,Normal,Male,Electronics,45.35,6,Ewallet,6.1
3048,8/30/2024,Brooklyn,Normal,Female,Health & Beauty,24.78,2,Credit card,6.0

In [ ]:
df.isna() # missing value handle

,Date,Branch,Customer type,Gender,Product line,Unit price,Quantity,Payment,Rating
0,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...
5048,False,False,False,False,False,False,False,False,False
5049,False,False,False,False,False,False,False,False,False
5050,False,False,False,False,False,False,False,False,False
5051,False,False,False,False,False,False,False,False,False
5052,False,False,False,False,False,False,False,False,False

In [26]:
df.isna().sum() # missing value handle

Date             0
Branch           0
Customer type    0
Gender           0
Product line     0
Unit price       0
Quantity         0
Payment          0
Rating           0
dtype: int64